app/controllers/posts_controller.rb

  def create
      @post = Post.new                         # create a new object
      @post.title = params[:title]             # add title
      @post.description = params[:description] # add description
      @post.save                               # Save the object and the attributes of the new post
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2015-12-31 19:45:52.559860"], ["updated_at", "2015-12-31 19:45:52.559860"]]